alefragnani.project-manager
angular.ng-template
charliermarsh.ruff
chunsen.bracket-select
dbcode.dbcode
dotjoshjohnson.xml
eamodio.gitlens
github.remotehub
github.vscode-pull-request-github
gitlab.gitlab-workflow
hediet.vscode-drawio
mikestead.dotenv
ms-azuretools.vscode-azureappservice
ms-azuretools.vscode-azureresourcegroups
ms-azuretools.vscode-containers
ms-azuretools.vscode-docker
ms-kubernetes-tools.vscode-kubernetes-tools
ms-python.debugpy
ms-python.mypy-type-checker
ms-python.python
ms-python.vscode-pylance
ms-python.vscode-python-envs
ms-toolsai.datawrangler
ms-vscode-remote.remote-containers
ms-vscode-remote.remote-ssh
ms-vscode-remote.remote-ssh-edit
ms-vscode-remote.remote-wsl
ms-vscode-remote.vscode-remote-extensionpack
ms-vscode.azure-repos
ms-vscode.remote-explorer
ms-vscode.remote-repositories
ms-vscode.remote-server
ms-vsliveshare.vsliveshare
redhat.vscode-yaml
tamasfe.even-better-toml
upstash.context7-mcp
yzhang.markdown-all-in-one
